_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
lstm_26 (LSTM)               (None, 35, 50)            14600     
_________________________________________________________________
dropout_9 (Dropout)          (None, 35, 50)            0         
_________________________________________________________________
lstm_27 (LSTM)               (None, 50)                20200     
_________________________________________________________________
dense_15 (Dense)             (None, 1)                 51        
=================================================================
Total params: 34,851
Trainable params: 34,851
Non-trainable params: 0
_________________________________________________________________

Saved at   09-02-2019 17-04-51
                           Value
Metric                          
R Squared               -10.8279
Root Mean Squared Error   0.1010
Thiel's U                 5.5948