_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
lstm_28 (LSTM)               (None, 14, 50)            14600     
_________________________________________________________________
dropout_10 (Dropout)         (None, 14, 50)            0         
_________________________________________________________________
lstm_29 (LSTM)               (None, 50)                20200     
_________________________________________________________________
dense_16 (Dense)             (None, 1)                 51        
=================================================================
Total params: 34,851
Trainable params: 34,851
Non-trainable params: 0
_________________________________________________________________

Saved at   09-02-2019 17-11-46
                          Value
Metric                         
R Squared               -0.1785
Root Mean Squared Error  0.0524
Thiel's U                2.6854