_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
lstm_30 (LSTM)               (None, 14, 50)            14200     
_________________________________________________________________
dropout_11 (Dropout)         (None, 14, 50)            0         
_________________________________________________________________
lstm_31 (LSTM)               (None, 50)                20200     
_________________________________________________________________
dense_17 (Dense)             (None, 1)                 51        
=================================================================
Total params: 34,451
Trainable params: 34,451
Non-trainable params: 0
_________________________________________________________________

Saved at   09-02-2019 17-33-31
                          Value
Metric                         
R Squared               -3.2872
Root Mean Squared Error  0.1000
Thiel's U                4.9871