_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
lstm_32 (LSTM)               (None, 35, 50)            14200     
_________________________________________________________________
dropout_12 (Dropout)         (None, 35, 50)            0         
_________________________________________________________________
lstm_33 (LSTM)               (None, 50)                20200     
_________________________________________________________________
dense_18 (Dense)             (None, 1)                 51        
=================================================================
Total params: 34,451
Trainable params: 34,451
Non-trainable params: 0
_________________________________________________________________

Saved at   09-02-2019 17-48-12
                           Value
Metric                          
R Squared               -14.6797
Root Mean Squared Error   0.1163
Thiel's U                 6.4410