_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
lstm_14 (LSTM)               (None, 14, 50)            12400     
_________________________________________________________________
dropout_4 (Dropout)          (None, 14, 50)            0         
_________________________________________________________________
lstm_15 (LSTM)               (None, 50)                20200     
_________________________________________________________________
dense_9 (Dense)              (None, 1)                 51        
=================================================================
Total params: 32,651
Trainable params: 32,651
Non-trainable params: 0
_________________________________________________________________

Saved at   09-02-2019 14-43-28
                          Value
Metric                         
R Squared                0.5790
Root Mean Squared Error  0.0220
Thiel's U                1.3047