_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
lstm_12 (LSTM)               (None, 14, 50)            12400     
_________________________________________________________________
dropout_3 (Dropout)          (None, 14, 50)            0         
_________________________________________________________________
lstm_13 (LSTM)               (None, 50)                20200     
_________________________________________________________________
dense_8 (Dense)              (None, 1)                 51        
=================================================================
Total params: 32,651
Trainable params: 32,651
Non-trainable params: 0
_________________________________________________________________

Saved at   09-02-2019 14-19-45
                          Value
Metric                         
R Squared                0.3166
Root Mean Squared Error  0.0280
Thiel's U                1.7243