_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
input_10 (InputLayer)        (None, 35)                0         
_________________________________________________________________
embedding_42 (Embedding)     (None, 35, 100)           119351500 
_________________________________________________________________
conv1d_20 (Conv1D)           (None, 31, 128)           64128     
_________________________________________________________________
max_pooling1d_15 (MaxPooling (None, 6, 128)            0         
_________________________________________________________________
conv1d_21 (Conv1D)           (None, 128, 124)          3968      
_________________________________________________________________
max_pooling1d_16 (MaxPooling (None, 25, 124)           0         
_________________________________________________________________
conv1d_22 (Conv1D)           (None, 21, 128)           79488     
_________________________________________________________________
global_max_pooling1d_4 (Glob (None, 128)               0         
_________________________________________________________________
dense_53 (Dense)             (None, 128)               16512     
_________________________________________________________________
dense_54 (Dense)             (None, 3)                 387       
=================================================================
Total params: 119,515,983
Trainable params: 164,483
Non-trainable params: 119,351,500
_________________________________________________________________

Saved at   09-22-2019 15-51-53
              precision    recall  f1-score   support

           0       0.32      1.00      0.49       172
           1       0.00      0.00      0.00       194
           2       0.00      0.00      0.00       168

   micro avg       0.32      0.32      0.32       534
   macro avg       0.11      0.33      0.16       534
weighted avg       0.10      0.32      0.16       534
